{
	"schedule": [
		{
			"title": "Continental Angular breakfast",
			"description": "<p>Enjoy the continental breakfast buffet together with the speakers</p>",
			"startDate": "2017-12-08T07:00:00+01:00",
			"endDate": "2017-12-08T08:30:00+01:00",
			"type": "break"
		},
		{
			"title": "Opening Ceremony",
			"startDate": "2017-12-08T08:45:00+01:00",
			"endDate": "2017-12-08T09:00:00+01:00",
			"type": "talk"
		},
		{
			"title": "Angular Elements",
			"description": "<p>In this talk we’ll take a look at experimental APIs that enable us to generate native Web Components from Angular components.</p>",
			"startDate": "2017-12-08T09:00:00+01:00",
			"endDate": "2017-12-08T09:30:00+01:00",
			"type": "talk",
			"speaker": [
				{
					"id": 0,
					"firstName": "Pascal",
					"name": "Precht",
					"picture": "https://ng-be.org/components/conference-day/img/pascal-precht.jpg"
				}
			]
		},
		{
			"title": "Building High Performance Static Website with Angular",
			"description": "<p>Traditionally, AngularJS has been used for building rich single-page applications.</p><p>Nowadays, Angular has become a universal framework, running inside the browser, in the backend and even powering your mobile apps.</p><p>The new Angular version unlocks some interesting use-cases that were not previously possible. In this talk, we are going to see how to set up angular- universal together with fuse-box for building scalable, high-performance static web sites, such as a blog or a landing page that can be easily deployed to gh- pages or Firebase Hosting.</p><p>Did I mention hot-reloading, of ine support and Progressive Web Apps?</p>",
			"startDate": "2017-12-08T09:35:00+01:00",
			"endDate": "2017-12-08T10:05:00+01:00",
			"type": "talk",
			"speaker": [
				{
					"id": 9,
					"firstName": "Uri",
					"name": "Shaked",
					"picture": "https://ng-be.org/components/conference-day/img/uri-shaked.jpg"
				}
			]
		},
		{
			"title": "Create and publish Angular libs like a Pro",
			"description": "<p>Libraries are the building blocks of every serious application. As such, a healthy ecosystem of reusable tools and libraries are extremely important for the success of a frontend framework.</p><p>In this talk we will learn how to contribute to the Angular ecosystem by learning how to build and release Angular libraries like a pro. We will explore their structure, learn about bundling techniques and formats and  nally about semantic versioning & continuous, automated deployment to NPM.</p>",
			"startDate": "2017-12-08T10:10:00+01:00",
			"endDate": "2017-12-08T10:40:00+01:00",
			"type": "talk",
			"speaker": [
				{
					"id": 5,
					"firstName": "Juri",
					"name": "Strumpflohner",
					"picture": "https://ng-be.org/components/conference-day/img/juri-strumpflohner.jpg"
				}
			]
		},
		{
			"title": "Break with coffees, teas, juices, fresh yoghurts and fruits",
			"endDate": "2017-12-08T11:00:00+01:00",
			"startDate": "2017-12-08T10:40:00+01:00",
			"type": "break"
		},
		{
			"title": "Sponsor talk: ARHS",
			"description": "<p>Arηs Digital is a strong player in the domain of Digital Transformation, Digital Business Platforms, Web Development, Open Source Software Development and Business Intelligence. We apply state-of- the art Open Source technologies (Micro- services (Spring Boot, Spring Cloud), Angular (4+), ...) and consult in complex matters. We are a believer of Agile Scrum Methodology and embrace end-to end IT projects.</p><p>We continuously reach out to talented people looking for interesting projects, a great team to work in and an attractive salary package. We reach out to all organizations looking for a professional partner to deliver their IT projects and programs in time and in budget.</p><p>“Companies don’t do business with each other. Business is done between people. It’s about trust, commitment and understanding.” – Gunther Roobaert, Managing Director Arηs Digital.</p>",
			"endDate": "2017-12-08T11:05:00+01:00",
			"startDate": "2017-12-08T11:00:00+01:00",
			"type": "sponsor"
		},
		{
			"title": "Hidden Gems of TypeScript compiler",
			"description": "<p>TypeScript provides a powerful compiler we use most of the time for transpiling codebase in our projects. But it also have hidden features that can help us on so many fantastical tasks. Let’s see in this talk how this compiler works, and how we can use it for statical analysis (Codelyzer, TSLint), context aware replacement, code visualization (ngrev), documentation (Compodoc, TypeDoc), or language service plugin (Angular Language Service).</p>",
			"startDate": "2017-12-08T11:10:00+01:00",
			"endDate": "2017-12-08T11:40:00+01:00",
			"type": "talk",
			"speaker": [
				{
					"id": 11,
					"firstName": "Vincent",
					"name": "Ogloblinsky",
					"picture": "https://ng-be.org/components/conference-day/img/vincent-ogloblinsky.jpg"
				}
			]
		},
		{
			"title": "Cookies versus tokens: a paradoxical choice",
			"description": "<p>When you’re building Angular applications, you will need to  gure out how to manage your user’s sessions. Back in the days, this used to be simple. But now, there are many different options, all with speci c advantages and disadvantages. How can you make a sensible choice, and how will that impact the security of your application? This talk will lay it out for you. You will learn how to assess your past choices, and how to substantiate future decisions.</p>",
			"startDate": "2017-12-08T11:45:00+01:00",
			"endDate": "2017-12-08T12:15:00+01:00",
			"type": "talk",
			"speaker": [
				{
					"id": 2,
					"firstName": "Philippe",
					"name": "De Ryck",
					"picture": "https://ng-be.org/components/conference-day/img/philippe-deryck.jpg"
				}
			]
		},
		{
			"title": "Sponsor giveaway: EURICOM",
			"description": "<p>Euricom - a software consultancy company founded in 1999 – has a focus on high-quality coding and working together as a team.</p><p>We believe in a co-creation model by bringing talented people together on customer projects to help them craft the digital world of tomorrow.</p><p>Besides that, you will meet a team that will help you to harmonize the things in life that really matter.</p>",
			"endDate": "2017-12-08T12:20:00+01:00",
			"startDate": "2017-12-08T12:15:00+01:00",
			"type": "sponsor"
		},
		{
			"title": "Creating Angular Progressive Web App",
			"description": "<p>We have at least two very interesting options to get Angular PWA. First, the native Angular Service Worker (NGSW) by Angular team, super-powered by Angular CLI and some extra ng-pwa-tools. Second, the all new framework-agnostic Workbox library by Google Chrome team. What’s easier to set up for your Angular app? What has wider functionality? What’s faster and more robust? Let’s go exploring, coding and testing! You will have 100% full overview of these two approaches after my session, but the  nal decision is only yours!”</p>",
			"startDate": "2017-12-08T12:20:00+01:00",
			"endDate": "2017-12-08T12:40:00+01:00",
			"type": "talk",
			"speaker": [
				{
					"id": 10,
					"firstName": "Maxim",
					"name": "Salnikov",
					"picture": "https://ng-be.org/components/conference-day/img/maxim-salnikov.jpg"
				}
			]
		},
		{
			"title": "Lunch: fresh soup, salads, selections of cold and warm fish and meat dishes, dessert",
			"startDate": "2017-12-08T12:40:00+01:00",
			"endDate": "2017-12-08T14:00:00+01:00",
			"type": "lunch"
		},
		{
			"title": "Sponsor talk: ORDINA",
			"description": "<p>Ordina believes in a digital world that helps people, companies and society forwards. The application of ICT plays an essential role in solving social and business issues. Thus, technology can help to create a breakthrough in making government more ef cient, in keeping care affordable and in guaranteeing secure internet transactions. As creators, architects and administrators of the digital world, we have expertise to make organisations more agile by continuously improving business processes and ICT.</p><p>First and foremost, Ordina is a people company and is one of the top ICT employers. The quality of our service is determined by the level of our professionals. For that reason we pay close attention to our personnel policy and we focus on the growth and development of employees.</p><p>With over 2,900 employees, Ordina is the largest, independent ICT-service provider in the Benelux. We are active in the  nancial services, industry, care and government sectors. That needs people who are just as dedicated and enterprising as we are. People who look beyond the technology.</p><p>Are you a fan of technical and cultural trends such as Microservices and DevOps? Do you want to help business in their transformation to cloud-native market disruptors? Are you eager to use Angular in your next project? To turn your hobby into your profession and implement end-to-end Internet of Things solutions for our customers? To participate in workshops, organised by your colleagues, or attend well-known international conferences to further enhance your level of competence as a developer? Then Ordina’s Java unit (JWorks) or Microsoft (NCore) is the ideal place for you! You will join a creative, professional and dynamic team! Feel free to discover our Accelerator program.</p>",
			"startDate": "2017-12-08T14:00:00+01:00",
			"endDate": "2017-12-08T14:10:00+01:00",
			"type": "sponsor"
		},
		{
			"title": "A close look to Angular's new HttpClient",
			"description": "<p>Nearly all Angular applications must communicate with HTTP-based APIs. To make this task easier, Angular 4.3 introduced the new HttpClient.</p><p>This session looks at its possibilities. It shows how to use not only JSON but also other text-based formats like XML or CSV.</p><p>Furthermore, you will see how to deal with binary streams and how your application can get progress information when doing file up- and downloads.</p><p>In addition, we will look at Interceptors that allow to implement cross-cutting concerns like security checks, logging, or caching.</p><p>Finally, you will see how to protect from XSRF attacks and what the HttpClient holds in store for testing.</p>",
			"startDate": "2017-12-08T14:15:00+01:00",
			"endDate": "2017-12-08T14:45:00+01:00",
			"type": "talk",
			"speaker": [
				{
					"id": 4,
					"firstName": "Manfred",
					"name": "Steyer",
					"picture": "https://ng-be.org/components/conference-day/img/manfred-steyer.jpg"
				}
			]
		},
		{
			"title": "It's Not Dark Magic - Pulling Back the Curtains From Your Stylesheets",
			"description": "<p>All too often developers are left completely puzzled when the browser renders CSS in ways they didn’t expect. It’s not dark magic though and as developers we know that computers are just parsing our instructions. While many talks discuss how to  x common bugs, this talk will focus on the why by taking a deep dive into browser internals to see how our styles are parsed and rendered.</p>",
			"startDate": "2017-12-08T14:50:00+01:00",
			"endDate": "2017-12-08T15:20:00+01:00",
			"type": "talk",
			"speaker": [
				{
					"id": 6,
					"firstName": "Aimee",
					"name": "Knight",
					"picture": "https://ng-be.org/components/conference-day/img/aimee-knight.jpg"
				}
			]
		},
		{
			"title": "How to hack an Angular app?",
			"description": "<p>Thought hacking was hard? It’s not, it’s easy and I’m going to show you how! In this episode of CSI Belgium we’ll investigate a series of hacking stories and break them down step-by-step to see exactly how they did it. By the end you’ll walk away a little bit more scared and a lot more prepared with some great practices you can apply immediately to your own applications.</p>",
			"startDate": "2017-12-08T15:25:00+01:00",
			"endDate": "2017-12-08T15:55:00+01:00",
			"type": "talk",
			"speaker": [
				{
					"id": 8,
					"firstName": "Assim",
					"name": "Hussain",
					"picture": "https://ng-be.org/components/conference-day/img/asim-hussain.png"
				}
			]
		},
		{
			"title": "Break with coffees, teas, juices, fresh yoghurts and fruits",
			"startDate": "2017-12-08T15:55:00+01:00",
			"endDate": "2017-12-08T16:15:00+01:00",
			"type": "break"
		},
		{
			"title": "Sponsor talk: aariXa",
			"description": "<p>Founded in 2005, today a growing company that chooses stability and quality over quantity. Focusing on Front-end, .NET & JAVA technologies, we de ne and optimize solutions for SME as well as for large international companies. “You’re not a number” is our key value.</p>",
			"startDate": "2017-12-08T16:15:00+01:00",
			"endDate": "2017-12-08T16:20:00+01:00",
			"type": "sponsor"
		},
		{
			"title": "Taming snakes with reactive streams",
			"description": "<p>In this talk you will learn how to think reactively by implementing a snakes game without relying on any external state variables. In addition you will learn how to make use of some very common operators including scan, withLatestFrom, combineLatest etc.</p>",
			"startDate": "2017-12-08T16:25:00+01:00",
			"endDate": "2017-12-08T16:55:00+01:00",
			"type": "talk",
			"speaker": [
				{
					"id": 3,
					"firstName": "Dominic",
					"name": "Elm",
					"picture": "https://ng-be.org/components/conference-day/img/dominic-elm.jpg"
				}
			]
		},
		{
			"title": "Performant Augmented Reality for the Web",
			"description": "<p>Augmented Reality is opening up new and exciting possibilities for users. Today we are able to develop pure web experiences that works on mobile devices. While it is exciting, it is a brand new technology. Creating Augmented Reality experiences involves several APIs, WebRTC, WebGL and more.</p><p>Let’s look at how we can make it easier to create Augmented Reality experiences with declarative Angular components. We will go over the performance considerations as well as the “Hello AR!” example code and resources.</p>",
			"startDate": "2017-12-08T17:00:00+01:00",
			"endDate": "2017-12-08T17:30:00+01:00",
			"type": "talk",
			"speaker": [
				{
					"id": 7,
					"firstName": "Ayşegül",
					"name": "Yönet",
					"picture": "https://ng-be.org/components/conference-day/img/aysegul-yonet.jpg"
				}
			]
		},
		{
			"title": "Angular Architecture: From Patterns to Implementation",
			"description": "<p>Design patterns are what drives sensible architecture, and this applies to code organisation, component and module architecture, all the way through to state management. Let’s see how they all work as individual patterns, and explore their implementation in code. Once we know how the moving pieces work, we can easily  t them together to build solid apps that head in the same direction.</p>",
			"startDate": "2017-12-08T17:35:00+01:00",
			"endDate": "2017-12-08T18:05:00+01:00",
			"type": "talk",
			"speaker": [
				{
					"id": 1,
					"firstName": "Todd",
					"name": "Motto",
					"picture": "https://ng-be.org/components/conference-day/img/todd-motto.jpg"
				}
			]
		},
		{
			"title": "Conference closing ceremony",
			"startDate": "2017-12-08T18:05:00+01:00",
			"endDate": "2017-12-08T18:20:00+01:00",
			"type": "talk"
		},
		{
			"title": "Socialize - bar",
			"startDate": "2017-12-08T18:05:00+01:00",
			"endDate": "2017-12-08T18:20:00+01:00",
			"type": "break"
		},
		{
			"title": "End of conference",
			"startDate": "2017-12-08T19:30:00+01:00",
			"endDate": "2017-12-08T20:00:00+01:00",
			"type": "break"
		}
	],
	"speakers": [
		{
			"name": "Precht",
			"firstName": "Pascal",
			"title": "Trainer at @thoughtram, GDE, Happy Fellow",
			"description": "<p>Pascal is a Software Engineer and Trainer at thoughtram and founder of the MachineLabs project, with the mission to make Machine Learning accessible to everyone.</p>",
			"picture": "https://ng-be.org/components/conference-day/img/pascal-precht.jpg",
			"contact": {
				"twitter": "PascalPrecht",
				"github": "PascalPrecht",
				"website": {
					"title": "Thoughtram",
					"url": "http://thoughtram.io/"
				}
			}
		},
		{
			"name": "Motto",
			"firstName": "Todd",
			"title": "Owner at Ultimate Angular, GDE Angular and Web",
			"description": "<p>Todd is a Google Developer Expert (GDE) for both Angular and Web Technologies, and was one of the first to be invited by Google to the GDE Program back in 2014. Todd has been working with Angular for over 5 years, writes technical posts on his personal blog, and he regularly talks at industry leading conferences on Angular and web.</p>",
			"picture": "https://ng-be.org/components/conference-day/img/todd-motto.jpg",
			"contact": {
				"twitter": "toddmotto",
				"github": "ToddMotto",
				"website": {
					"title": "Ultimate Angular",
					"url": "https://ultimateangular.com/"
				}
			}
		},
		{
			"name": "De Ryck",
			"firstName": "Philippe",
			"title": "Web Security Expert",
			"description": "<p>Philippe runs the Web Security Training program at iMinds-DistriNet Research Group, KU Leuven. Through practical, hands-on trainings, Philippe teaches about relevant threats, current state-of-practice security technologies, and upcoming technologies to keep an eye on.</p>",
			"picture": "https://ng-be.org/components/conference-day/img/philippe-deryck.jpg",
			"contact": {
				"twitter": "philippederyck",
				"github": "PhilippeDeRyck",
				"website": {
					"title": "websec.be",
					"url": "https://www.websec.be/"
				}
			}
		},
		{
			"name": "Elm",
			"firstName": "Dominic",
			"title": "Trainer at Thoughtram",
			"description": "<p>Dominic is a graduate in computer science and is passionate about many web technologies including Angular, Firebase, and ReactiveX. He has always been enthusiastic about teaching. In fact, Dominic devoted his thesis on the topic of enterprise gamification making the process of sharing and learning within companies fun and enjoyable for everyone. At the moment he’s a Trainer at thoughtram providing Angular trainings worldwide.</p>",
			"picture": "https://ng-be.org/components/conference-day/img/dominic-elm.jpg",
			"contact": {
				"twitter": "elmd_",
				"github": "d3lm",
				"website": {
					"title": "Thoughtram",
					"url": "http://thoughtram.io/"
				}
			}
		},
		{
			"name": "Steyer",
			"firstName": "Manfred",
			"title": "Freelance trainer and consultant, GDE",
			"description": "<p>Trainer and Consultant with focus on Angular. Google Developer Expert (GDE) who writes for O’Reilly, the German Java Magazine and windows.developer. Regularly speaks at conferences.</p>",
			"picture": "https://ng-be.org/components/conference-day/img/manfred-steyer.jpg",
			"contact": {
				"twitter": "ManfredSteyer",
				"github": "manfredsteyer",
				"website": {
					"title": "Software Architekt",
					"url": "https://www.softwarearchitekt.at/index.aspx"
				}
			}
		},
		{
			"name": "Strumpflohner",
			"firstName": "Juri",
			"title": "Trainer, Egghead Instructor, Blogger, GDE",
			"description": "<p>Juri currently works as a software architect at R3 GIS, a company combining GIS and Angular into powerful and modern web applications. He has worked with a variety of technologies ranging from .Net, Java and Node but has a particular love for all things JavaScript and Angular.</p><p>He’s also a freelance trainer & consultant, Egghead.io instructor, blogger and technical writer. Feel free to follow him on Twitter or visit his blog.</p>",
			"picture": "https://ng-be.org/components/conference-day/img/juri-strumpflohner.jpg",
			"contact": {
				"twitter": "juristr",
				"github": "juristr",
				"website": {
					"title": "juristr.com",
					"url": "https://juristr.com"
				}
			}
		},
		{
			"name": "Knight",
			"firstName": "Aimee",
			"title": "Software engineer at Warner Bros.",
			"description": "<p>Aimee Knight is a former figure skater, graduate of the Nashville Software School, and a software engineer for Warner Bros. Outside of work, she’s a weekly panelist on the JavaScript Jabber podcast, and she regularly participates in a variety of others. In her spare time, she enjoys speaking at conferences, playing with new technology, running, working out, or trying the latest flavor of Kombucha. Find her, and her contagious enthusiasm on Twitter!</p>",
			"picture": "https://ng-be.org/components/conference-day/img/aimee-knight.jpg",
			"contact": {
				"twitter": "Aimee_Knight",
				"github": "AimeeKnight",
				"website": {
					"title": "aimeemarieknight.com",
					"url": "http://www.aimeemarieknight.com/"
				}
			}
		},
		{
			"name": "Yönet",
			"firstName": "Ayşegül",
			"title": "GDE, Web Technologies",
			"description": "<p>Ayşegül is a JavaScript developer focusing on Angular, WebVR and Data Visualization. She is a Developer Expert at Google for Web Technologies/Angular and an active conference speaker. She is a Senior Angular Engineer at Narwhal Technologies (Nrwl.io). She worked as Senior Software Engineer at Autodesk Play, a 3D and VR authoring tool that is currently in beta. She enjoys teaching at a variety of non-profit organizations aiming to increase diversity in the software industry.</p>",
			"picture": "https://ng-be.org/components/conference-day/img/aysegul-yonet.jpg",
			"contact": {
				"twitter": "AysSomething",
				"github": "Yonet",
				"website": {
					"title": "Nrwl.io",
					"url": "https://nrwl.io"
				}
			}
		},
		{
			"name": "Hussain",
			"firstName": "Asim",
			"title": "Cloud developer advocate @Microsoft",
			"description": "<p>Asim is a developer, trainer, author and speaker with over 16 years experience working for organisations such as the European Space Agency, Google and now Microsoft, where he is a Senior Cloud Developer Advocate.</p>",
			"picture": "https://ng-be.org/components/conference-day/img/asim-hussain.png",
			"contact": {
				"twitter": "jawache",
				"github": "jawache",
				"website": {
					"title": "codecraft.tv",
					"url": "https://codecraft.tv/"
				}
			}
		},
		{
			"name": "Shaked",
			"firstName": "Uri",
			"title": "GDE for Web Technologies",
			"description": "<p>Uri Shaked is a Google Developer Expert for Web Technologies. He regularly writes about Web and IoT related technologies in his Medium blog, and speaks about these topics in conferences and meetups around the world. Among his interests are reverse engineering, hardware hacking, building 3D-printed robots and games, playing music and Salsa dancing.</p>",
			"picture": "https://ng-be.org/components/conference-day/img/uri-shaked.jpg",
			"contact": {
				"twitter": "UriShaked",
				"github": "urish",
				"website": {
					"title": "Blog",
					"url": "https://medium.com/@urish"
				}
			}
		},
		{
			"name": "Salnikov",
			"firstName": "Maxim",
			"title": "ngViking, UI Engineer, GDE",
			"description": "<p>Maxim Salnikov is an Oslo-based Web UI Engineer and a Google Developer Expert in Web Technologies and Angular. He develops complex web applications since the end of the last century and has extensive experience with all aspects of web front-end: UX/UI prototyping, HTML/CSS/JS, main frameworks, progressive web apps.</p><p>Maxim is a founder and active contributor to two conferences: Mobile Era and ngVikings - Nordics' main conferences for mobile and Angular developers respectively. He also leads Norway's largest meetups dedicated to web front-end and mobile: Framsia, Angular Oslo, Mobile Meetup Oslo.</p>",
			"picture": "https://ng-be.org/components/conference-day/img/maxim-salnikov.jpg",
			"contact": {
				"twitter": "webmaxru",
				"github": "webmaxru",
				"website": {
					"title": "Blog",
					"url": "https://medium.com/@webmaxru"
				}
			}
		},
		{
			"name": "Ogloblinsky",
			"firstName": "Vincent",
			"title": "Front-end Architect",
			"description": "<p>Vincent is a Software architect in a French IT services company called SII. He likes web technologies & all APIs availables in the browser, and most of the times he uses them in (Type||Java)script. He loves to share his knowledge by giving lightning talks or mob programming sessions, training sessions on Angular or by speaking at french conferences. He also contributes to and maintains open-source projects like \"Compodoc\".</p>",
			"picture": "https://ng-be.org/components/conference-day/img/vincent-ogloblinsky.jpg",
			"contact": {
				"twitter": "vogloblinsky",
				"github": "vogloblinsky",
				"website": {
					"title": "Website",
					"url": "http://www.vincentogloblinsky.com/"
				}
			}
		}
	]
}
